r4hul77/Docker-Vscode-STM32/Skid_Steer/App/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_Btn_Pin GPIO_PIN_13
#define USER_Btn_GPIO_Port GPIOC
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOH
#define currentBattery_Pin GPIO_PIN_1
#define currentBattery_GPIO_Port GPIOC
#define voltageBattery_Pin GPIO_PIN_2
#define voltageBattery_GPIO_Port GPIOC
#define encoderAMotorFR_Pin GPIO_PIN_0
#define encoderAMotorFR_GPIO_Port GPIOA
#define encoderBMotorFR_Pin GPIO_PIN_1
#define encoderBMotorFR_GPIO_Port GPIOA
#define currentMotorFR_Pin GPIO_PIN_4
#define currentMotorFR_GPIO_Port GPIOA
#define currentMotorFL_Pin GPIO_PIN_5
#define currentMotorFL_GPIO_Port GPIOA
#define currentMotorBR_Pin GPIO_PIN_6
#define currentMotorBR_GPIO_Port GPIOA
#define currentMotorBL_Pin GPIO_PIN_7
#define currentMotorBL_GPIO_Port GPIOA
#define LD1_Pin GPIO_PIN_0
#define LD1_GPIO_Port GPIOB
#define uartRx_Pin GPIO_PIN_7
#define uartRx_GPIO_Port GPIOE
#define uartTx_Pin GPIO_PIN_8
#define uartTx_GPIO_Port GPIOE
#define pwmMotorFR_Pin GPIO_PIN_9
#define pwmMotorFR_GPIO_Port GPIOE
#define pwmMotorFL_Pin GPIO_PIN_11
#define pwmMotorFL_GPIO_Port GPIOE
#define pwmMotorBR_Pin GPIO_PIN_13
#define pwmMotorBR_GPIO_Port GPIOE
#define pwmMotorBL_Pin GPIO_PIN_14
#define pwmMotorBL_GPIO_Port GPIOE
#define LD3_Pin GPIO_PIN_14
#define LD3_GPIO_Port GPIOB
#define STLK_RX_Pin GPIO_PIN_8
#define STLK_RX_GPIO_Port GPIOD
#define STLK_TX_Pin GPIO_PIN_9
#define STLK_TX_GPIO_Port GPIOD
#define encoderAMotorBL_Pin GPIO_PIN_12
#define encoderAMotorBL_GPIO_Port GPIOD
#define encoderBMotorBL_Pin GPIO_PIN_13
#define encoderBMotorBL_GPIO_Port GPIOD
#define SD_Detect_Pin GPIO_PIN_2
#define SD_Detect_GPIO_Port GPIOG
#define USB_OverCurrent_Pin GPIO_PIN_7
#define USB_OverCurrent_GPIO_Port GPIOG
#define encoderAMotorBR_Pin GPIO_PIN_6
#define encoderAMotorBR_GPIO_Port GPIOC
#define encoderBMotorBR_Pin GPIO_PIN_7
#define encoderBMotorBR_GPIO_Port GPIOC
#define sdCardD0_Pin GPIO_PIN_8
#define sdCardD0_GPIO_Port GPIOC
#define sdCardD1_Pin GPIO_PIN_9
#define sdCardD1_GPIO_Port GPIOC
#define USB_SOF_Pin GPIO_PIN_8
#define USB_SOF_GPIO_Port GPIOA
#define USB_VBUS_Pin GPIO_PIN_9
#define USB_VBUS_GPIO_Port GPIOA
#define USB_ID_Pin GPIO_PIN_10
#define USB_ID_GPIO_Port GPIOA
#define USB_DM_Pin GPIO_PIN_11
#define USB_DM_GPIO_Port GPIOA
#define USB_DP_Pin GPIO_PIN_12
#define USB_DP_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define encoderAMotorFL_Pin GPIO_PIN_15
#define encoderAMotorFL_GPIO_Port GPIOA
#define sdCardD2_Pin GPIO_PIN_10
#define sdCardD2_GPIO_Port GPIOC
#define sdCardD3_Pin GPIO_PIN_11
#define sdCardD3_GPIO_Port GPIOC
#define sdCardCK_Pin GPIO_PIN_12
#define sdCardCK_GPIO_Port GPIOC
#define sdCardCMD_Pin GPIO_PIN_2
#define sdCardCMD_GPIO_Port GPIOD
#define encoderBMotorFL_Pin GPIO_PIN_3
#define encoderBMotorFL_GPIO_Port GPIOB
#define LD2_Pin GPIO_PIN_7
#define LD2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
